content/EmacsBlogs/20250302100324-tab_bar_mode.org
# -*- coding: utf-8-dos; -*-
:PROPERTIES:
:ID:       1b390354-59a4-494e-858e-011e6b1e1f5a
:END:
#+title: tab bar mode
